Split database-index into btree-index and lsm-tree
